StoneRose35/cortexguitarfx/Inc/RpiPico/hardware/rp2040_registers.h
#ifndef _RP2040_REGISTERS_
#define _RP2040_REGISTERS_

#include "stdint.h"

/**
 * @brief device-specific settings such as pin numbers and timings
 * 
 */

// ***************
// * pin numbers *
// ***************
#define RP2040_LED_PIN (25) // 13 on rp2040 feather, 25 on rpi pico boards

#define I2C_SCL 5
#define I2C_SDA 4

#define AUDIO_CODEC_RESET 3

#define I2S_BCK_PIN 11
#define I2S_WS_PIN 10
#define I2S_DATA_IN_PIN 9
#define I2S_DATA_PIN 12
#define I2S_MCLK_PIN 8 //unused
#define I2S_DEBUG_PIN 6 //unused

#define CLIPPING_LED_INPUT 16
#define CLIPPING_LED_OUTPUT 17

// rotary encoder combined with a push switch
#define ENCODER_1 7
#define ENCODER_2 6
#define ENTER_SWITCH 22
#define EXIT_SWITCH 20
#define POWERSENSE 13

// driver for ssd1306-based display (128*64 pixel oled display interfaced using spi)
#define SSD1306_CS_DISPLAY 21
#define SSD1306_SCK 18
#define SSD1306_MOSI 19
#define SSD1306_DISPLAY_CD 14
#define SSD1306_DISPLAY_RESET 15

// pin definitions for two uart ports
#define UART_USB_RX 1
#define UART_USB_TX 0

// -----------------------------------------------------------------------------------------

#define UART_BT_RX 9
#define UART_BT_TX 8

// debug pin
#define DEBUG_PIN_1 2

// 1.8" Color TFT LCD display with MicroSD Card Breakout - ST7735R
// one spi sharing connection to a ST7735 display and  an sd card
#define CS_SDCARD 5
#define CS_DISPLAY 12
#define MISO 20
#define MOSI 19
#define SCK 18
#define DISPLAY_RESET 24
#define DISPLAY_CD 25
#define DISPLAY_BACKLIGHT 8 

#define REMOTESWITCH_PIN 14 // 433 MHz radio-controller switch, reverse-engineered

#define DS18B20_PIN 2

#define HEATER  6 // heating element controlled using pwm

// backlight for lcd display
#define BACKLIGHT 8

// GPIO number where the neopixel is attached
// Integrated Neopixel on RP2040 Feather: 16
// Integrated Neopixel on RP2040 Itsybitsy: 17
#ifdef ITSYBITSY
#define NEOPIXEL_PIN 17
#define NEOPIXEL_POWER_PIN 16
#else
#define NEOPIXEL_PIN 16
#endif

// ****************************************
// * other device-specific configurations *
// ****************************************
#define DS18B20_INSTR_MEM_OFFSET 10
#define DS18B20_CLKDIV 480 // 4 us clockdiv
#define DS18B20_CLKDIV_READ 120 // 1 us clock
#define DS18B20_RESET_CLKDIV 3600 // 30 us clockdiv

// 120MHz / 78.125 = 48kHz*2*16
#define I2S_CLKDIV_INT 40 //39
#define I2S_CLKDIV_FRAC 0 //16

#define I2S_CLKDIV_DBL_INT 10 //19
#define I2S_CLKDIV_DBL_FRAC 0//136

#define I2S_CLKDIV_MCLK_INT 5//9
#define I2S_CLKDIV_MCLK_FRAC 0 //196

#define REMOTESWITCH_CLKDIV 26640
#define REMOTESWITCH_INSTR_MEM_OFFSET 20

#define SCK_SDCARD_INIT 199 // SPI clock divider for SD-Card initialization
#define SCK_SDCARD_MEDIUM 5 // SPI clock divider for SD-Card operation
#define SCK_DISPLAY_SLOW 5 // resulting in 10 MHz spi clock for display

#define SSD1306_SCK_DISPLAY_SLOW 10 // resulting in 5 MHz spi clock for display

/**
 * @brief register definitions
 * 
 */
#define RESETS ((volatile uint32_t*)(RESETS_BASE + RESETS_RESET_OFFSET))
#define RESETS_DONE ((volatile uint32_t*)(RESETS_BASE + RESETS_RESET_DONE_OFFSET))

#define CLK_ADC_CTRL ((volatile uint32_t*)(CLOCKS_BASE + CLOCKS_CLK_ADC_CTRL_OFFSET))
#define CLK_ADC_DIV ((volatile uint32_t*)(CLOCKS_BASE + CLOCKS_CLK_ADC_DIV_OFFSET))
#define CLK_USB_CTRL ((volatile uint32_t*)(CLOCKS_BASE + CLOCKS_CLK_USB_CTRL_OFFSET))

#define ADC_CS ((volatile uint32_t*)(ADC_BASE + ADC_CS_OFFSET))
#define ADC_DIV ((volatile uint32_t*)(ADC_BASE + ADC_DIV_OFFSET))
#define ADC_RESULT ((volatile uint32_t*)(ADC_BASE + ADC_RESULT_OFFSET))
#define ADC_FCS ((volatile uint32_t*)(ADC_BASE + ADC_FCS_OFFSET))
#define ADC_FIFO ((volatile uint32_t*)(ADC_BASE + ADC_FIFO_OFFSET))
#define ADC_INTE ((volatile uint32_t*)(ADC_BASE + ADC_INTE_OFFSET))

#define PADS_ADC0 ((volatile uint32_t*)(PADS_BANK0_BASE + PADS_BANK0_GPIO26_OFFSET))


#define GPIO_OE ((volatile uint32_t*)(SIO_BASE + SIO_GPIO_OE_OFFSET))
#define GPIO_OUT ((volatile uint32_t*)(SIO_BASE + SIO_GPIO_OUT_OFFSET))
#define GPIO_IN ((volatile uint32_t*)(SIO_BASE + SIO_GPIO_IN_OFFSET))

#define DMA_CH0_WRITE_ADDR ((volatile uint32_t*)(DMA_BASE+DMA_CH0_WRITE_ADDR_OFFSET))
#define DMA_CH0_READ_ADDR ((volatile uint32_t*)(DMA_BASE+DMA_CH0_READ_ADDR_OFFSET))
#define DMA_CH0_CTRL_TRIG ((volatile uint32_t*)(DMA_BASE+DMA_CH0_CTRL_TRIG_OFFSET))
#define DMA_CH0_TRANS_COUNT ((volatile uint32_t*)(DMA_BASE+DMA_CH0_TRANS_COUNT_OFFSET))

#define DMA_CH1_WRITE_ADDR ((volatile uint32_t*)(DMA_BASE+DMA_CH1_WRITE_ADDR_OFFSET))
#define DMA_CH1_READ_ADDR ((volatile uint32_t*)(DMA_BASE+DMA_CH1_READ_ADDR_OFFSET))
#define DMA_CH1_CTRL_TRIG ((volatile uint32_t*)(DMA_BASE+DMA_CH1_CTRL_TRIG_OFFSET))
#define DMA_CH1_TRANS_COUNT ((volatile uint32_t*)(DMA_BASE+DMA_CH1_TRANS_COUNT_OFFSET))

#define DMA_CH2_WRITE_ADDR ((volatile uint32_t*)(DMA_BASE+DMA_CH2_WRITE_ADDR_OFFSET))
#define DMA_CH2_READ_ADDR ((volatile uint32_t*)(DMA_BASE+DMA_CH2_READ_ADDR_OFFSET))
#define DMA_CH2_CTRL_TRIG ((volatile uint32_t*)(DMA_BASE+DMA_CH2_CTRL_TRIG_OFFSET))
#define DMA_CH2_TRANS_COUNT ((volatile uint32_t*)(DMA_BASE+DMA_CH2_TRANS_COUNT_OFFSET))
#define DMA_CH2_TRANS_COUNT_TRIG ((volatile uint32_t*)(DMA_BASE+DMA_CH2_TRANS_COUNT_OFFSET+0x14))

#define DMA_CH3_WRITE_ADDR ((volatile uint32_t*)(DMA_BASE+DMA_CH3_WRITE_ADDR_OFFSET))
#define DMA_CH3_READ_ADDR ((volatile uint32_t*)(DMA_BASE+DMA_CH3_READ_ADDR_OFFSET))
#define DMA_CH3_CTRL_TRIG ((volatile uint32_t*)(DMA_BASE+DMA_CH3_CTRL_TRIG_OFFSET))
#define DMA_CH3_TRANS_COUNT ((volatile uint32_t*)(DMA_BASE+DMA_CH3_TRANS_COUNT_OFFSET))
#define DMA_CH3_TRANS_COUNT_TRIG ((volatile uint32_t*)(DMA_BASE+DMA_CH3_TRANS_COUNT_OFFSET+0x14))

#define DMA_CH4_WRITE_ADDR ((volatile uint32_t*)(DMA_BASE+DMA_CH4_WRITE_ADDR_OFFSET))
#define DMA_CH4_READ_ADDR ((volatile uint32_t*)(DMA_BASE+DMA_CH4_READ_ADDR_OFFSET))
#define DMA_CH4_CTRL_TRIG ((volatile uint32_t*)(DMA_BASE+DMA_CH4_CTRL_TRIG_OFFSET))
#define DMA_CH4_TRANS_COUNT ((volatile uint32_t*)(DMA_BASE+DMA_CH4_TRANS_COUNT_OFFSET))
#define DMA_CH4_TRANS_COUNT_TRIG ((volatile uint32_t*)(DMA_BASE+DMA_CH4_TRANS_COUNT_OFFSET+0x14))

#define DMA_INTE0 ((volatile uint32_t*)(DMA_BASE+DMA_INTE0_OFFSET))
#define DMA_INTS0 ((volatile uint32_t*)(DMA_BASE+DMA_INTS0_OFFSET))


#define SIO_FIFO_ST ((volatile uint32_t*)(SIO_BASE + SIO_FIFO_ST_OFFSET))
#define SIO_FIFO_RD ((volatile uint32_t*)(SIO_BASE + SIO_FIFO_RD_OFFSET))
#define SIO_FIFO_WR ((volatile uint32_t*)(SIO_BASE + SIO_FIFO_WR_OFFSET))
#define SIO_CPUID ((volatile uint32_t*)(SIO_BASE))

#define M0PLUS_VTOR ((volatile uint32_t*)(PPB_BASE + M0PLUS_VTOR_OFFSET))
#define NVIC_ISER ((volatile uint32_t*)(PPB_BASE + M0PLUS_NVIC_ISER_OFFSET))
#define NVIC_ICER ((volatile uint32_t*)(PPB_BASE + M0PLUS_NVIC_ICER_OFFSET))
#define NVIC_IPR7 ((volatile uint32_t*)(PPB_BASE + M0PLUS_NVIC_IPR7_OFFSET))
#define NVIC_IPR6 ((volatile uint32_t*)(PPB_BASE + M0PLUS_NVIC_IPR6_OFFSET))
#define NVIC_IPR5 ((volatile uint32_t*)(PPB_BASE + M0PLUS_NVIC_IPR5_OFFSET))
#define NVIC_IPR4 ((volatile uint32_t*)(PPB_BASE + M0PLUS_NVIC_IPR4_OFFSET))
#define NVIC_IPR3 ((volatile uint32_t*)(PPB_BASE + M0PLUS_NVIC_IPR3_OFFSET))
#define NVIC_IPR2 ((volatile uint32_t*)(PPB_BASE + M0PLUS_NVIC_IPR2_OFFSET))
#define NVIC_IPR1 ((volatile uint32_t*)(PPB_BASE + M0PLUS_NVIC_IPR1_OFFSET))
#define NVIC_IPR0 ((volatile uint32_t*)(PPB_BASE + M0PLUS_NVIC_IPR0_OFFSET))


#define RESETS ((volatile uint32_t*)(RESETS_BASE + RESETS_RESET_OFFSET))
#define RESETS_DONE ((volatile uint32_t*)(RESETS_BASE + RESETS_RESET_DONE_OFFSET))

#define PIO_SM0_EXECCTRL ((volatile uint32_t*)(PIO0_BASE+PIO_SM0_EXECCTRL_OFFSET))
#define PIO_SM0_SHIFTCTRL ((volatile uint32_t*)(PIO0_BASE+PIO_SM0_SHIFTCTRL_OFFSET))
#define PIO_SM0_PINCTRL ((volatile uint32_t*)(PIO0_BASE+PIO_SM0_PINCTRL_OFFSET))
#define PIO_SM0_CLKDIV ((volatile uint32_t*)(PIO0_BASE+PIO_SM0_CLKDIV_OFFSET))
#define PIO_SM0_TXF ((volatile uint32_t*)(PIO0_BASE+PIO_TXF0_OFFSET))
#define PIO_SM0_INSTR  ((volatile uint32_t*)(PIO0_BASE+PIO_SM0_INSTR_OFFSET))

#define PIO_SM1_EXECCTRL ((volatile uint32_t*)(PIO0_BASE+PIO_SM1_EXECCTRL_OFFSET))
#define PIO_SM1_SHIFTCTRL ((volatile uint32_t*)(PIO0_BASE+PIO_SM1_SHIFTCTRL_OFFSET))
#define PIO_SM1_PINCTRL ((volatile uint32_t*)(PIO0_BASE+PIO_SM1_PINCTRL_OFFSET))
#define PIO_SM1_CLKDIV ((volatile uint32_t*)(PIO0_BASE+PIO_SM1_CLKDIV_OFFSET))
#define PIO_SM1_TXF ((volatile uint32_t*)(PIO0_BASE+PIO_TXF1_OFFSET))
#define PIO_SM1_INSTR  ((volatile uint32_t*)(PIO0_BASE+PIO_SM1_INSTR_OFFSET))

#define PIO_SM2_EXECCTRL ((volatile uint32_t*)(PIO0_BASE+PIO_SM2_EXECCTRL_OFFSET))
#define PIO_SM2_SHIFTCTRL ((volatile uint32_t*)(PIO0_BASE+PIO_SM2_SHIFTCTRL_OFFSET))
#define PIO_SM2_PINCTRL ((volatile uint32_t*)(PIO0_BASE+PIO_SM2_PINCTRL_OFFSET))
#define PIO_SM2_CLKDIV ((volatile uint32_t*)(PIO0_BASE+PIO_SM2_CLKDIV_OFFSET))
#define PIO_SM2_TXF ((volatile uint32_t*)(PIO0_BASE+PIO_TXF2_OFFSET))
#define PIO_SM2_INSTR  ((volatile uint32_t*)(PIO0_BASE+PIO_SM2_INSTR_OFFSET))
#define PIO_SM2_RXF ((volatile uint32_t*)(PIO0_BASE+PIO_RXF2_OFFSET))

