StoneRose35/cortexguitarfx/Inc/RpiPico/hardware/rp2040_registers.h
#define PIO_SM3_EXECCTRL ((volatile uint32_t*)(PIO0_BASE+PIO_SM3_EXECCTRL_OFFSET))
#define PIO_SM3_SHIFTCTRL ((volatile uint32_t*)(PIO0_BASE+PIO_SM3_SHIFTCTRL_OFFSET))
#define PIO_SM3_PINCTRL ((volatile uint32_t*)(PIO0_BASE+PIO_SM3_PINCTRL_OFFSET))
#define PIO_SM3_CLKDIV ((volatile uint32_t*)(PIO0_BASE+PIO_SM3_CLKDIV_OFFSET))
#define PIO_SM3_TXF ((volatile uint32_t*)(PIO0_BASE+PIO_TXF3_OFFSET))
#define PIO_SM3_INSTR  ((volatile uint32_t*)(PIO0_BASE+PIO_SM3_INSTR_OFFSET))
#define PIO_SM3_RXF ((volatile uint32_t*)(PIO0_BASE+PIO_RXF3_OFFSET))

#define PIO_CTRL ((volatile uint32_t*)(PIO0_BASE+PIO_CTRL_OFFSET))
#define PIO_INSTR_MEM ((volatile uint32_t*)(PIO0_BASE+PIO_INSTR_MEM0_OFFSET))
#define PIO_INTE ((volatile uint32_t*)(PIO0_BASE + PIO_IRQ0_INTE_OFFSET))
#define PIO_INTF ((volatile uint32_t*)(PIO0_BASE + PIO_IRQ0_INTF_OFFSET))
#define PIO_IRQ ((volatile uint32_t*)(PIO0_BASE + PIO_IRQ_OFFSET))
#define PIO_IRQ_FORCE ((volatile uint32_t*)(PIO0_BASE + PIO_IRQ_FORCE_OFFSET))
#define PIO_FSTAT ((volatile uint32_t*)(PIO0_BASE + PIO_FSTAT_OFFSET))
#define PIO_FDEBUG ((volatile uint32_t*)(PIO0_BASE + PIO_FDEBUG_OFFSET))

#define PIO1_CTRL ((volatile uint32_t*)(PIO1_BASE+PIO_CTRL_OFFSET))
#define PIO1_INSTR_MEM ((volatile uint32_t*)(PIO1_BASE+PIO_INSTR_MEM0_OFFSET))
#define PIO1_INTE ((volatile uint32_t*)(PIO1_BASE + PIO_IRQ0_INTE_OFFSET))
#define PIO1_INTF ((volatile uint32_t*)(PIO1_BASE + PIO_IRQ0_INTF_OFFSET))
#define PIO1_IRQ ((volatile uint32_t*)(PIO1_BASE + PIO_IRQ_OFFSET))
#define PIO1_IRQ_FORCE ((volatile uint32_t*)(PIO1_BASE + PIO_IRQ_FORCE_OFFSET))
#define PIO1_FSTAT ((volatile uint32_t*)(PIO1_BASE + PIO_FSTAT_OFFSET))

#define PIO1_INSTR_MEM ((volatile uint32_t*)(PIO1_BASE+PIO_INSTR_MEM0_OFFSET))
#define PIO1_CTRL ((volatile uint32_t*)(PIO1_BASE+PIO_CTRL_OFFSET))
#define PIO1_IRQ ((volatile uint32_t*)(PIO1_BASE + PIO_IRQ_OFFSET))
#define PIO1_FDEBUG ((volatile uint32_t*)(PIO1_BASE + PIO_FDEBUG_OFFSET))
#define PIO1_FSTAT ((volatile uint32_t*)(PIO1_BASE + PIO_FSTAT_OFFSET))

#define PIO1_SM0_EXECCTRL ((volatile uint32_t*)(PIO1_BASE+PIO_SM0_EXECCTRL_OFFSET))
#define PIO1_SM0_SHIFTCTRL ((volatile uint32_t*)(PIO1_BASE+PIO_SM0_SHIFTCTRL_OFFSET))
#define PIO1_SM0_PINCTRL ((volatile uint32_t*)(PIO1_BASE+PIO_SM0_PINCTRL_OFFSET))
#define PIO1_SM0_CLKDIV ((volatile uint32_t*)(PIO1_BASE+PIO_SM0_CLKDIV_OFFSET))
#define PIO1_SM0_TXF ((volatile uint32_t*)(PIO1_BASE+PIO_TXF0_OFFSET))
#define PIO1_SM0_INSTR  ((volatile uint32_t*)(PIO1_BASE+PIO_SM0_INSTR_OFFSET))
#define PIO1_SM0_RXF ((volatile uint32_t*)(PIO1_BASE+PIO_RXF0_OFFSET))

#define PIO1_SM1_EXECCTRL ((volatile uint32_t*)(PIO1_BASE+PIO_SM1_EXECCTRL_OFFSET))
#define PIO1_SM1_SHIFTCTRL ((volatile uint32_t*)(PIO1_BASE+PIO_SM1_SHIFTCTRL_OFFSET))
#define PIO1_SM1_PINCTRL ((volatile uint32_t*)(PIO1_BASE+PIO_SM1_PINCTRL_OFFSET))
#define PIO1_SM1_CLKDIV ((volatile uint32_t*)(PIO1_BASE+PIO_SM1_CLKDIV_OFFSET))
#define PIO1_SM1_TXF ((volatile uint32_t*)(PIO1_BASE+PIO_TXF1_OFFSET))
#define PIO1_SM1_INSTR  ((volatile uint32_t*)(PIO1_BASE+PIO_SM1_INSTR_OFFSET))
#define PIO1_SM1_RXF ((volatile uint32_t*)(PIO1_BASE+PIO_RXF1_OFFSET))

#define PIO1_SM2_EXECCTRL ((volatile uint32_t*)(PIO1_BASE+PIO_SM2_EXECCTRL_OFFSET))
#define PIO1_SM2_SHIFTCTRL ((volatile uint32_t*)(PIO1_BASE+PIO_SM2_SHIFTCTRL_OFFSET))
#define PIO1_SM2_PINCTRL ((volatile uint32_t*)(PIO1_BASE+PIO_SM2_PINCTRL_OFFSET))
#define PIO1_SM2_CLKDIV ((volatile uint32_t*)(PIO1_BASE+PIO_SM2_CLKDIV_OFFSET))
#define PIO1_SM2_TXF ((volatile uint32_t*)(PIO1_BASE+PIO_TXF2_OFFSET))
#define PIO1_SM2_INSTR  ((volatile uint32_t*)(PIO1_BASE+PIO_SM2_INSTR_OFFSET))
#define PIO1_SM2_RXF ((volatile uint32_t*)(PIO1_BASE+PIO_RXF2_OFFSET))


#define I2C_ENABLE_IC ((volatile uint32_t*)(I2C0_BASE +I2C_IC_ENABLE_OFFSET))
#define I2C_IC_CON ((volatile uint32_t*)(I2C0_BASE +I2C_IC_CON_OFFSET))
#define I2C_IC_TAR ((volatile uint32_t*)(I2C0_BASE +I2C_IC_TAR_OFFSET))
#define I2C_IC_SAR ((volatile uint32_t*)(I2C0_BASE +I2C_IC_SAR_OFFSET))
#define I2C_IC_DATA_CMD ((volatile uint32_t*)(I2C0_BASE +I2C_IC_DATA_CMD_OFFSET))
#define I2C_IC_DATA_CMD_BYTE ((volatile uint8_t*)(I2C0_BASE +I2C_IC_DATA_CMD_OFFSET))
#define I2C_IC_INTR_STAT ((volatile uint32_t*)(I2C0_BASE +I2C_IC_INTR_STAT_OFFSET))
#define I2C_IC_INTR_MASK ((volatile uint32_t*)(I2C0_BASE +I2C_IC_INTR_MASK_OFFSET))
#define I2C_IC_CLR_RX_DONE ((volatile uint32_t*)(I2C0_BASE +I2C_IC_CLR_RX_DONE_OFFSET))
#define I2C_IC_CLR_INTR ((volatile uint32_t*)(I2C0_BASE +I2C_IC_CLR_INTR_OFFSET))
#define I2C_IC_CLR_START_DET ((volatile uint32_t*)(I2C0_BASE +I2C_IC_CLR_START_DET_OFFSET))
#define I2C_IC_CLR_STOP_DET ((volatile uint32_t*)(I2C0_BASE +I2C_IC_CLR_STOP_DET_OFFSET))
#define I2C_IC_CLR_TX_ABRT ((volatile uint32_t*)(I2C0_BASE +I2C_IC_CLR_TX_ABRT_OFFSET))
#define I2C_IC_TXFLR ((volatile uint32_t*)(I2C0_BASE +I2C_IC_TXFLR_OFFSET))
#define I2C_IC_TX_TL ((volatile uint32_t*)(I2C0_BASE +I2C_IC_TX_TL_OFFSET))
#define I2C_IC_RXFLR ((volatile uint32_t*)(I2C0_BASE +I2C_IC_RXFLR_OFFSET))
#define I2C_IC_RX_TL ((volatile uint32_t*)(I2C0_BASE +I2C_IC_RX_TL_OFFSET))
#define I2C_IC_DMA_CR ((volatile uint32_t*)(I2C0_BASE +I2C_IC_DMA_CR_OFFSET))
#define I2C_IC_SS_SCL_HCNT ((volatile uint32_t*)(I2C0_BASE +I2C_IC_SS_SCL_HCNT_OFFSET))
#define I2C_IC_SS_SCL_LCNT ((volatile uint32_t*)(I2C0_BASE +I2C_IC_SS_SCL_LCNT_OFFSET))
#define I2C_IC_STATUS ((volatile uint32_t*)(I2C0_BASE +I2C_IC_STATUS_OFFSET))

#define I2C_IC_CLR_TX_ABRT ((volatile uint32_t*)(I2C0_BASE +I2C_IC_CLR_TX_ABRT_OFFSET))
#define I2C_IC_RAW_INTR_STAT ((volatile uint32_t*)(I2C0_BASE +I2C_IC_RAW_INTR_STAT_OFFSET))
#define I2C_IC_TX_ABRT_SOURCE ((volatile uint32_t*)(I2C0_BASE +I2C_IC_TX_ABRT_SOURCE_OFFSET))

#define SSPCR0 ((volatile uint32_t*)(SPI0_BASE +  SPI_SSPCR0_OFFSET))
#define SSPCR1 ((volatile uint32_t*)(SPI0_BASE +  SPI_SSPCR1_OFFSET))
#define SSPCPSR ((volatile uint32_t*)(SPI0_BASE +  SPI_SSPCPSR_OFFSET))
#define SSPDR ((volatile uint32_t*)(SPI0_BASE +  SPI_SSPDR_OFFSET))
#define SSPSR ((volatile uint32_t*)(SPI0_BASE +  SPI_SSPSR_OFFSET))
#define SSPDMACR ((volatile uint32_t*)(SPI0_BASE + SPI_SSPDMACR_OFFSET))

#define XOSC_STARTUP ((volatile uint32_t*)(XOSC_BASE+XOSC_STARTUP_OFFSET))
#define XOSC_CTRL_ENABLE ((volatile uint32_t*)(XOSC_BASE+XOSC_CTRL_OFFSET))
#define XOSC_STATUS ((volatile uint32_t*)(XOSC_BASE+XOSC_STATUS_OFFSET))

