StoneRose35/cortexguitarfx/Inc/RpiPico/hardware/rp2040_registers.h
#define CLK_SYS_CTRL ((volatile uint32_t*)(CLOCKS_BASE+CLOCKS_CLK_SYS_CTRL_OFFSET))
#define CLK_REF_CTRL ((volatile uint32_t*)(CLOCKS_BASE+CLOCKS_CLK_REF_CTRL_OFFSET))
#define CLK_PERI_CTRL ((volatile uint32_t*)(CLOCKS_BASE+CLOCKS_CLK_PERI_CTRL_OFFSET))

#define VREG ((volatile uint32_t*)(VREG_AND_CHIP_RESET_BASE))

typedef struct {
	volatile uint32_t cs;
	volatile uint32_t pwr;
	volatile uint32_t fbdiv;
	volatile uint32_t prim;
} PllType;

#define PLL_SYS ((PllType*)PLL_SYS_BASE)

#define PLL_USB ((PllType*)PLL_USB_BASE)

#define M0PLUS_SYST_CSR ((volatile uint32_t*)(PPB_BASE + M0PLUS_SYST_CSR_OFFSET))
#define M0PLUS_SYST_RVR ((volatile uint32_t*)(PPB_BASE + M0PLUS_SYST_RVR_OFFSET))
#define M0PLUS_SYST_CVR ((volatile uint32_t*)(PPB_BASE + M0PLUS_SYST_CVR_OFFSET))

// device-specific pins/pads
#define DS18B20_PIN_CNTR ((volatile uint32_t*)(IO_BANK0_BASE + IO_BANK0_GPIO0_CTRL_OFFSET + 8*DS18B20_PIN))
#define DS18B20_PAD_CNTR ((volatile uint32_t*)(PADS_BANK0_BASE + PADS_BANK0_GPIO0_OFFSET + 4*DS18B20_PIN))
#define HEATER_PIN_CNTR ((volatile uint32_t*)(IO_BANK0_BASE + IO_BANK0_GPIO0_CTRL_OFFSET + 8*HEATER))
#define DEBUG_LED_PIN_CNTR ((volatile uint32_t*)(IO_BANK0_BASE + IO_BANK0_GPIO0_CTRL_OFFSET + 8*RP2040_LED_PIN))

#define I2S_WS_PIN_CNTR ((volatile uint32_t*)(IO_BANK0_BASE + IO_BANK0_GPIO0_CTRL_OFFSET + 8*I2S_WS_PIN))
#define I2S_WS_PAD_CNTR ((volatile uint32_t*)(PADS_BANK0_BASE + PADS_BANK0_GPIO0_OFFSET + 4*I2S_WS_PIN))
#define I2S_BCK_PIN_CNTR ((volatile uint32_t*)(IO_BANK0_BASE + IO_BANK0_GPIO0_CTRL_OFFSET + 8*I2S_BCK_PIN))
#define I2S_BCK_PAD_CNTR ((volatile uint32_t*)(PADS_BANK0_BASE + PADS_BANK0_GPIO0_OFFSET + 4*I2S_BCK_PIN))
#define I2S_DATA_PIN_CNTR ((volatile uint32_t*)(IO_BANK0_BASE + IO_BANK0_GPIO0_CTRL_OFFSET + 8*I2S_DATA_PIN))
#define I2S_DATA_PAD_CNTR ((volatile uint32_t*)(PADS_BANK0_BASE + PADS_BANK0_GPIO0_OFFSET + 4*I2S_DATA_PIN))
#define I2S_DATA_IN_PIN_CNTR ((volatile uint32_t*)(IO_BANK0_BASE + IO_BANK0_GPIO0_CTRL_OFFSET + 8*I2S_DATA_IN_PIN))
#define I2S_DATA_IN_PAD_CNTR ((volatile uint32_t*)(PADS_BANK0_BASE + PADS_BANK0_GPIO0_OFFSET + 4*I2S_DATA_IN_PIN))
#define I2S_MCLK_PIN_CNTR ((volatile uint32_t*)(IO_BANK0_BASE + IO_BANK0_GPIO0_CTRL_OFFSET + 8*I2S_MCLK_PIN))
#define I2S_MCLK_PAD_CNTR ((volatile uint32_t*)(PADS_BANK0_BASE + PADS_BANK0_GPIO0_OFFSET + 4*I2S_MCLK_PIN))
#define I2S_DEBUG_PIN_CNTR ((volatile uint32_t*)(IO_BANK0_BASE + IO_BANK0_GPIO0_CTRL_OFFSET + 8*I2S_DEBUG_PIN))
#define I2S_DEBUG_PAD_CNTR ((volatile uint32_t*)(PADS_BANK0_BASE + PADS_BANK0_GPIO0_OFFSET + 4*I2S_DEBUG_PIN))

#define NEOPIXEL_PIN_CNTR ((volatile uint32_t*)(IO_BANK0_BASE + IO_BANK0_GPIO0_CTRL_OFFSET + 8*NEOPIXEL_PIN))
#ifdef ITSYBITSY
#define NEOPIXEL_POWER_PIN_CNTR ((volatile uint32_t*)(IO_BANK0_BASE + IO_BANK0_GPIO0_CTRL_OFFSET + 8*NEOPIXEL_POWER_PIN))
#endif

#define REMOTESWITCH_PIN_CNTR ((volatile uint32_t*)(IO_BANK0_BASE + IO_BANK0_GPIO0_CTRL_OFFSET + 8*REMOTESWITCH_PIN))
#define REMOTESWITCH_PAD_CNTR ((volatile uint32_t*)(PADS_BANK0_BASE + PADS_BANK0_GPIO0_OFFSET + 4*REMOTESWITCH_PIN))


#define ENCODER_1_PIN_CNTR  ((volatile uint32_t*)(IO_BANK0_BASE + IO_BANK0_GPIO0_CTRL_OFFSET + 8*ENCODER_1))
#define ENCODER_1_PAD_CNTR ((volatile uint32_t*)(PADS_BANK0_BASE + PADS_BANK0_GPIO0_OFFSET + 4*ENCODER_1))
#define ENCODER_1_INTE ((volatile uint32_t*)(IO_BANK0_BASE + IO_BANK0_PROC1_INTE0_OFFSET + (((4*ENCODER_1) & 0xFFE0) >> 3)))
#define ENCODER_1_INTR ((volatile uint32_t*)(IO_BANK0_BASE + IO_BANK0_INTR0_OFFSET + (((4*ENCODER_1) & 0xFFE0) >> 3)))
#define ENCODER_1_EDGE_LOW (((4*ENCODER_1) & 0x1F)+2)
#define ENCODER_1_EDGE_HIGH (((4*ENCODER_1) & 0x1F)+3)

#define ENCODER_2_PIN_CNTR  ((volatile uint32_t*)(IO_BANK0_BASE + IO_BANK0_GPIO0_CTRL_OFFSET + 8*ENCODER_2))
#define ENCODER_2_PAD_CNTR ((volatile uint32_t*)(PADS_BANK0_BASE + PADS_BANK0_GPIO0_OFFSET + 4*ENCODER_2))
#define ENCODER_2_INTE ((volatile uint32_t*)(IO_BANK0_BASE + IO_BANK0_PROC1_INTE0_OFFSET + (((4*ENCODER_2) & 0xFFE0) >> 3)))
#define ENCODER_2_INTR ((volatile uint32_t*)(IO_BANK0_BASE + IO_BANK0_INTR0_OFFSET + (((4*ENCODER_2) & 0xFFE0) >> 3)))
#define ENCODER_2_EDGE_LOW (((4*ENCODER_2) & 0x1F)+2)
#define ENCODER_2_EDGE_HIGH (((4*ENCODER_2) & 0x1F)+3)

#define POWERSENSE_PIN_CNTR ((volatile uint32_t*)(IO_BANK0_BASE + IO_BANK0_GPIO0_CTRL_OFFSET + 8*POWERSENSE))
#define POWERSENSE_PAD_CNTR ((volatile uint32_t*)(PADS_BANK0_BASE + PADS_BANK0_GPIO0_OFFSET + 4*POWERSENSE))
#define POWERSENSE_INTE ((volatile uint32_t*)(IO_BANK0_BASE + IO_BANK0_PROC1_INTE0_OFFSET + (((4*POWERSENSE) & 0xFFE0) >> 3)))
#define POWERSENSE_INTR ((volatile uint32_t*)(IO_BANK0_BASE + IO_BANK0_INTR0_OFFSET + (((4*POWERSENSE) & 0xFFE0) >> 3)))
#define POWERSENSE_EDGE_LOW (((4*POWERSENSE) & 0x1F)+2)

#define SWITCH_PIN_CNTR  ((volatile uint32_t*)(IO_BANK0_BASE + IO_BANK0_GPIO0_CTRL_OFFSET + 8*SWITCH))
#define SWITCH_PAD_CNTR ((volatile uint32_t*)(PADS_BANK0_BASE + PADS_BANK0_GPIO0_OFFSET + 4*SWITCH))
#define SWITCH_INTE ((volatile uint32_t*)(IO_BANK0_BASE + IO_BANK0_PROC1_INTE0_OFFSET + (((4*SWITCH) & 0xFFE0) >> 3)))
#define SWITCH_INTR ((volatile uint32_t*)(IO_BANK0_BASE + IO_BANK0_INTR0_OFFSET + (((4*SWITCH) & 0xFFE0) >> 3)))
#define SWITCH_EDGE_LOW (((4*SWITCH) & 0x1F)+2)
#define SWITCH_EDGE_HIGH (((4*SWITCH) & 0x1F)+3)

#define MISO_PIN_CNTR ((volatile uint32_t*)(IO_BANK0_BASE + IO_BANK0_GPIO0_CTRL_OFFSET + 8*MISO))
#define MOSI_PIN_CNTR ((volatile uint32_t*)(IO_BANK0_BASE + IO_BANK0_GPIO0_CTRL_OFFSET + 8*MOSI))
#define SCK_PIN_CNTR  ((volatile uint32_t*)(IO_BANK0_BASE + IO_BANK0_GPIO0_CTRL_OFFSET + 8*SCK))
#define MISO_PAD_CNTR ((volatile uint32_t*)(PADS_BANK0_BASE + PADS_BANK0_GPIO0_OFFSET + 4*MISO))
#define CS_SDCARD_PIN_CNTR ((volatile uint32_t*)(IO_BANK0_BASE + IO_BANK0_GPIO0_CTRL_OFFSET + 8*CS_SDCARD))
#define CS_DISPLAY_PIN_CNTR ((volatile uint32_t*)(IO_BANK0_BASE + IO_BANK0_GPIO0_CTRL_OFFSET + 8*CS_DISPLAY))

#define DISPLAY_RESET_PIN_CNTR ((volatile uint32_t*)(IO_BANK0_BASE + IO_BANK0_GPIO0_CTRL_OFFSET + 8*DISPLAY_RESET))
#define DISPLAY_CD_PIN_CNTR ((volatile uint32_t*)(IO_BANK0_BASE + IO_BANK0_GPIO0_CTRL_OFFSET + 8*DISPLAY_CD))

