StoneRose35/cortexguitarfx/Inc/RpiPico/hardware/rp2040_registers.h
#define I2C_SCL_PIN_CNTR ((volatile uint32_t*)(IO_BANK0_BASE + IO_BANK0_GPIO0_CTRL_OFFSET + 8*I2C_SCL))
#define I2C_SDA_PIN_CNTR ((volatile uint32_t*)(IO_BANK0_BASE + IO_BANK0_GPIO0_CTRL_OFFSET + 8*I2C_SDA))

#define I2C_SCL_PAD_CNTR ((volatile uint32_t*)(PADS_BANK0_BASE + 4*I2C_SCL + 4))
#define I2C_SDA_PAD_CNTR ((volatile uint32_t*)(PADS_BANK0_BASE + 4*I2C_SDA + 4))
#define AUDIO_CODEC_RESET_PIN_CNTR ((volatile uint32_t*)(IO_BANK0_BASE + IO_BANK0_GPIO0_CTRL_OFFSET + 8*AUDIO_CODEC_RESET))
#define AUDIO_CODEC_RESET_PAD_CNTR  ((volatile uint32_t*)(PADS_BANK0_BASE + 4*AUDIO_CODEC_RESET + 4))

#define DISPLAY_BACKLIGHT_PIN_CNTR ((volatile uint32_t*)(IO_BANK0_BASE + IO_BANK0_GPIO0_CTRL_OFFSET + 8*DISPLAY_BACKLIGHT))


#define SSD1306_MOSI_PIN_CNTR ((volatile uint32_t*)(IO_BANK0_BASE + IO_BANK0_GPIO0_CTRL_OFFSET + 8*SSD1306_MOSI))
#define SSD1306_CS_DISPLAY_PIN_CNTR ((volatile uint32_t*)(IO_BANK0_BASE + IO_BANK0_GPIO0_CTRL_OFFSET + 8*SSD1306_CS_DISPLAY))
#define SSD1306_DISPLAY_CD_PIN_CNTR ((volatile uint32_t*)(IO_BANK0_BASE + IO_BANK0_GPIO0_CTRL_OFFSET + 8*SSD1306_DISPLAY_CD))
#define SSD1306_SCK_PIN_CNTR ((volatile uint32_t*)(IO_BANK0_BASE + IO_BANK0_GPIO0_CTRL_OFFSET + 8*SSD1306_SCK))
#define SSD1306_DISPLAY_RESET_PIN_CNTR ((volatile uint32_t*)(IO_BANK0_BASE + IO_BANK0_GPIO0_CTRL_OFFSET + 8*SSD1306_DISPLAY_RESET))

#define TIMER_TIMEHW ((volatile uint32_t*)(TIMER_BASE + TIMER_TIMEHW_OFFSET))
#define TIMER_TIMELW ((volatile uint32_t*)(TIMER_BASE + TIMER_TIMELW_OFFSET))
#define TIMER_TIMEHR ((volatile uint32_t*)(TIMER_BASE + TIMER_TIMEHR_OFFSET))
#define TIMER_TIMELR ((volatile uint32_t*)(TIMER_BASE + TIMER_TIMELR_OFFSET))

#define WATCHDOG_TICK ((volatile uint32_t*)(WATCHDOG_BASE + WATCHDOG_TICK_OFFSET))

#define UART_UARTIBRD ((volatile uint32_t*)(UART0_BASE+UART_UARTIBRD_OFFSET))
#define UART_UARTFBRD ((volatile uint32_t*)(UART0_BASE+UART_UARTFBRD_OFFSET))
#define UART_UARTCR ((volatile uint32_t*)(UART0_BASE+UART_UARTCR_OFFSET))
#define UART_UARTLCR_H ((volatile uint32_t*)(UART0_BASE+UART_UARTLCR_H_OFFSET))
#define UART_RX_PIN_CNTR ((volatile uint32_t*)(IO_BANK0_BASE + IO_BANK0_GPIO0_CTRL_OFFSET + 8*UART_USB_RX))
#define UART_TX_PIN_CNTR ((volatile uint32_t*)(IO_BANK0_BASE + IO_BANK0_GPIO0_CTRL_OFFSET + 8*UART_USB_TX))
#define UART_UARTIMSC ((volatile uint32_t*)(UART0_BASE+UART_UARTIMSC_OFFSET))
#define UART_UARTMIS ((volatile uint32_t*)(UART0_BASE+UART_UARTMIS_OFFSET))
#define UART_UARTCR ((volatile uint32_t*)(UART0_BASE+UART_UARTCR_OFFSET))
#define UART_UARTDR ((volatile uint32_t*)(UART0_BASE+UART_UARTDR_OFFSET))
#define UART_UARTRIS ((volatile uint32_t*)(UART0_BASE+UART_UARTRIS_OFFSET))
#define UART_UARTFR ((volatile uint32_t*)(UART0_BASE+UART_UARTFR_OFFSET))
#define UART_UARTDMACR ((volatile uint32_t*)(UART0_BASE+UART_UARTDMACR_OFFSET))

#define UARTBT_UARTIBRD ((volatile uint32_t*)(UART1_BASE+UART_UARTIBRD_OFFSET))
#define UARTBT_UARTFBRD ((volatile uint32_t*)(UART1_BASE+UART_UARTFBRD_OFFSET))
#define UARTBT_UARTCR ((volatile uint32_t*)(UART1_BASE+UART_UARTCR_OFFSET))
#define UARTBT_UARTLCR_H ((volatile uint32_t*)(UART1_BASE+UART_UARTLCR_H_OFFSET))
#define UARTBT_RX_PIN_CNTR ((volatile uint32_t*)(IO_BANK0_BASE + IO_BANK0_GPIO0_CTRL_OFFSET + 8*UART_BT_RX))
#define UARTBT_TX_PIN_CNTR ((volatile uint32_t*)(IO_BANK0_BASE + IO_BANK0_GPIO0_CTRL_OFFSET + 8*UART_BT_TX))
#define UARTBT_UARTIMSC ((volatile uint32_t*)(UART1_BASE+UART_UARTIMSC_OFFSET))
#define UARTBT_UARTMIS ((volatile uint32_t*)(UART1_BASE+UART_UARTMIS_OFFSET))
#define UARTBT_UARTCR ((volatile uint32_t*)(UART1_BASE+UART_UARTCR_OFFSET))
#define UARTBT_UARTDR ((volatile uint32_t*)(UART1_BASE+UART_UARTDR_OFFSET))
#define UARTBT_UARTRIS ((volatile uint32_t*)(UART1_BASE+UART_UARTRIS_OFFSET))
#define UARTBT_UARTFR ((volatile uint32_t*)(UART1_BASE+UART_UARTFR_OFFSET))
#define UARTBT_UARTDMACR ((volatile uint32_t*)(UART1_BASE+UART_UARTDMACR_OFFSET))

// PWM Channels
#define PWM_CH1_CSR ((volatile uint32_t*)(PWM_BASE + PWM_CH0_CSR_OFFSET + 10*HEATER))
#define PWM_CH1_DIV ((volatile uint32_t*)(PWM_BASE + PWM_CH0_DIV_OFFSET + 10*HEATER))
#define PWM_CH1_CC ((volatile uint16_t*)(PWM_BASE + PWM_CH0_CC_OFFSET + 10*HEATER + (HEATER & 1)*2))
#define PWM_CH1_TOP ((volatile uint32_t*)(PWM_BASE + PWM_CH0_TOP_OFFSET + 10*HEATER))

#define PWM_CH0_CSR ((volatile uint32_t*)(PWM_BASE + PWM_CH0_CSR_OFFSET + 10*DISPLAY_BACKLIGHT))
#define PWM_CH0_DIV ((volatile uint32_t*)(PWM_BASE + PWM_CH0_DIV_OFFSET + 10*DISPLAY_BACKLIGHT))
#define PWM_CH0_CC ((volatile uint16_t*)(PWM_BASE + PWM_CH0_CC_OFFSET + 10*DISPLAY_BACKLIGHT + (DISPLAY_BACKLIGHT & 1)*2))
#define PWM_CH0_TOP ((volatile uint32_t*)(PWM_BASE + PWM_CH0_TOP_OFFSET + 10*DISPLAY_BACKLIGHT))

#endif